backend: tensorflow
class_name: Sequential
config:
  build_input_shape: !!python/object/apply:tensorflow.python.framework.tensor_shape.TensorShape
  - - !!python/object/apply:tensorflow.python.framework.tensor_shape.Dimension
      - null
    - !!python/object/apply:tensorflow.python.framework.tensor_shape.Dimension
      - 224
    - !!python/object/apply:tensorflow.python.framework.tensor_shape.Dimension
      - 224
    - !!python/object/apply:tensorflow.python.framework.tensor_shape.Dimension
      - 3
  layers:
  - class_name: Model
    config:
      batch_input_shape: !!python/tuple
      - null
      - 224
      - 224
      - 3
      input_layers:
      - - input_1
        - 0
        - 0
      layers:
      - class_name: InputLayer
        config:
          batch_input_shape: !!python/tuple
          - null
          - 224
          - 224
          - 3
          dtype: float32
          name: input_1
          ragged: false
          sparse: false
        inbound_nodes: []
        name: input_1
      - class_name: ZeroPadding2D
        config:
          data_format: channels_last
          dtype: float32
          name: Conv1_pad
          padding: !!python/tuple
          - !!python/tuple
            - 0
            - 1
          - !!python/tuple
            - 0
            - 1
          trainable: false
        inbound_nodes:
        - - - input_1
            - 0
            - 0
            - {}
        name: Conv1_pad
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: &id003 !!python/tuple
          - 1
          - 1
          dtype: float32
          filters: 32
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 3
          - 3
          name: Conv1
          padding: valid
          strides: !!python/tuple
          - 2
          - 2
          trainable: false
          use_bias: false
        inbound_nodes:
        - - - Conv1_pad
            - 0
            - 0
            - {}
        name: Conv1
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.999
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: bn_Conv1
          scale: true
          trainable: false
        inbound_nodes:
        - - - Conv1
            - 0
            - 0
            - {}
        name: bn_Conv1
      - class_name: ReLU
        config:
          dtype: float32
          max_value: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - &id001 !!python/name:numpy.ndarray ''
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - &id002 !!python/object/apply:numpy.dtype
              args:
              - f4
              - 0
              - 1
              state: !!python/tuple
              - 3
              - <
              - null
              - null
              - null
              - -1
              - -1
              - 0
            - false
            - !!binary |
              AADAQA==
          name: Conv1_relu
          negative_slope: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AAAAAA==
          threshold: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AAAAAA==
          trainable: false
        inbound_nodes:
        - - - bn_Conv1
            - 0
            - 0
            - {}
        name: Conv1_relu
      - class_name: DepthwiseConv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          depth_multiplier: 1
          depthwise_constraint: null
          depthwise_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          depthwise_regularizer: null
          dilation_rate: *id003
          dtype: float32
          kernel_size: !!python/tuple
          - 3
          - 3
          name: expanded_conv_depthwise
          padding: same
          strides: !!python/tuple
          - 1
          - 1
          trainable: false
          use_bias: false
        inbound_nodes:
        - - - Conv1_relu
            - 0
            - 0
            - {}
        name: expanded_conv_depthwise
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.999
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: expanded_conv_depthwise_BN
          scale: true
          trainable: false
        inbound_nodes:
        - - - expanded_conv_depthwise
            - 0
            - 0
            - {}
        name: expanded_conv_depthwise_BN
      - class_name: ReLU
        config:
          dtype: float32
          max_value: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AADAQA==
          name: expanded_conv_depthwise_relu
          negative_slope: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AAAAAA==
          threshold: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AAAAAA==
          trainable: false
        inbound_nodes:
        - - - expanded_conv_depthwise_BN
            - 0
            - 0
            - {}
        name: expanded_conv_depthwise_relu
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id003
          dtype: float32
          filters: 16
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          - 1
          name: expanded_conv_project
          padding: same
          strides: *id003
          trainable: false
          use_bias: false
        inbound_nodes:
        - - - expanded_conv_depthwise_relu
            - 0
            - 0
            - {}
        name: expanded_conv_project
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.999
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: expanded_conv_project_BN
          scale: true
          trainable: false
        inbound_nodes:
        - - - expanded_conv_project
            - 0
            - 0
            - {}
        name: expanded_conv_project_BN
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id003
          dtype: float32
          filters: 96
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          - 1
          name: block_1_expand
          padding: same
          strides: *id003
          trainable: false
          use_bias: false
        inbound_nodes:
        - - - expanded_conv_project_BN
            - 0
            - 0
            - {}
        name: block_1_expand
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.999
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: block_1_expand_BN
          scale: true
          trainable: false
        inbound_nodes:
        - - - block_1_expand
            - 0
            - 0
            - {}
        name: block_1_expand_BN
      - class_name: ReLU
        config:
          dtype: float32
          max_value: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AADAQA==
          name: block_1_expand_relu
          negative_slope: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AAAAAA==
          threshold: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AAAAAA==
          trainable: false
        inbound_nodes:
        - - - block_1_expand_BN
            - 0
            - 0
            - {}
        name: block_1_expand_relu
      - class_name: ZeroPadding2D
        config:
          data_format: channels_last
          dtype: float32
          name: block_1_pad
          padding: !!python/tuple
          - !!python/tuple
            - 0
            - 1
          - !!python/tuple
            - 0
            - 1
          trainable: false
        inbound_nodes:
        - - - block_1_expand_relu
            - 0
            - 0
            - {}
        name: block_1_pad
      - class_name: DepthwiseConv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          depth_multiplier: 1
          depthwise_constraint: null
          depthwise_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          depthwise_regularizer: null
          dilation_rate: *id003
          dtype: float32
          kernel_size: !!python/tuple
          - 3
          - 3
          name: block_1_depthwise
          padding: valid
          strides: !!python/tuple
          - 2
          - 2
          trainable: false
          use_bias: false
        inbound_nodes:
        - - - block_1_pad
            - 0
            - 0
            - {}
        name: block_1_depthwise
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.999
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: block_1_depthwise_BN
          scale: true
          trainable: false
        inbound_nodes:
        - - - block_1_depthwise
            - 0
            - 0
            - {}
        name: block_1_depthwise_BN
      - class_name: ReLU
        config:
          dtype: float32
          max_value: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AADAQA==
          name: block_1_depthwise_relu
          negative_slope: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AAAAAA==
          threshold: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AAAAAA==
          trainable: false
        inbound_nodes:
        - - - block_1_depthwise_BN
            - 0
            - 0
            - {}
        name: block_1_depthwise_relu
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id003
          dtype: float32
          filters: 24
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          - 1
          name: block_1_project
          padding: same
          strides: *id003
          trainable: false
          use_bias: false
        inbound_nodes:
        - - - block_1_depthwise_relu
            - 0
            - 0
            - {}
        name: block_1_project
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.999
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: block_1_project_BN
          scale: true
          trainable: false
        inbound_nodes:
        - - - block_1_project
            - 0
            - 0
            - {}
        name: block_1_project_BN
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id003
          dtype: float32
          filters: 144
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          - 1
          name: block_2_expand
          padding: same
          strides: *id003
          trainable: false
          use_bias: false
        inbound_nodes:
        - - - block_1_project_BN
            - 0
            - 0
            - {}
        name: block_2_expand
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.999
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: block_2_expand_BN
          scale: true
          trainable: false
        inbound_nodes:
        - - - block_2_expand
            - 0
            - 0
            - {}
        name: block_2_expand_BN
      - class_name: ReLU
        config:
          dtype: float32
          max_value: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AADAQA==
          name: block_2_expand_relu
          negative_slope: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AAAAAA==
          threshold: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AAAAAA==
          trainable: false
        inbound_nodes:
        - - - block_2_expand_BN
            - 0
            - 0
            - {}
        name: block_2_expand_relu
      - class_name: DepthwiseConv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          depth_multiplier: 1
          depthwise_constraint: null
          depthwise_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          depthwise_regularizer: null
          dilation_rate: *id003
          dtype: float32
          kernel_size: !!python/tuple
          - 3
          - 3
          name: block_2_depthwise
          padding: same
          strides: !!python/tuple
          - 1
          - 1
          trainable: false
          use_bias: false
        inbound_nodes:
        - - - block_2_expand_relu
            - 0
            - 0
            - {}
        name: block_2_depthwise
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.999
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: block_2_depthwise_BN
          scale: true
          trainable: false
        inbound_nodes:
        - - - block_2_depthwise
            - 0
            - 0
            - {}
        name: block_2_depthwise_BN
      - class_name: ReLU
        config:
          dtype: float32
          max_value: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AADAQA==
          name: block_2_depthwise_relu
          negative_slope: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AAAAAA==
          threshold: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AAAAAA==
          trainable: false
        inbound_nodes:
        - - - block_2_depthwise_BN
            - 0
            - 0
            - {}
        name: block_2_depthwise_relu
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id003
          dtype: float32
          filters: 24
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          - 1
          name: block_2_project
          padding: same
          strides: *id003
          trainable: false
          use_bias: false
        inbound_nodes:
        - - - block_2_depthwise_relu
            - 0
            - 0
            - {}
        name: block_2_project
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.999
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: block_2_project_BN
          scale: true
          trainable: false
        inbound_nodes:
        - - - block_2_project
            - 0
            - 0
            - {}
        name: block_2_project_BN
      - class_name: Add
        config:
          dtype: float32
          name: block_2_add
          trainable: false
        inbound_nodes:
        - - - block_1_project_BN
            - 0
            - 0
            - &id004 {}
          - - block_2_project_BN
            - 0
            - 0
            - *id004
        name: block_2_add
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id003
          dtype: float32
          filters: 144
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          - 1
          name: block_3_expand
          padding: same
          strides: *id003
          trainable: false
          use_bias: false
        inbound_nodes:
        - - - block_2_add
            - 0
            - 0
            - {}
        name: block_3_expand
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.999
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: block_3_expand_BN
          scale: true
          trainable: false
        inbound_nodes:
        - - - block_3_expand
            - 0
            - 0
            - {}
        name: block_3_expand_BN
      - class_name: ReLU
        config:
          dtype: float32
          max_value: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AADAQA==
          name: block_3_expand_relu
          negative_slope: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AAAAAA==
          threshold: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AAAAAA==
          trainable: false
        inbound_nodes:
        - - - block_3_expand_BN
            - 0
            - 0
            - {}
        name: block_3_expand_relu
      - class_name: ZeroPadding2D
        config:
          data_format: channels_last
          dtype: float32
          name: block_3_pad
          padding: !!python/tuple
          - !!python/tuple
            - 0
            - 1
          - !!python/tuple
            - 0
            - 1
          trainable: false
        inbound_nodes:
        - - - block_3_expand_relu
            - 0
            - 0
            - {}
        name: block_3_pad
      - class_name: DepthwiseConv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          depth_multiplier: 1
          depthwise_constraint: null
          depthwise_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          depthwise_regularizer: null
          dilation_rate: *id003
          dtype: float32
          kernel_size: !!python/tuple
          - 3
          - 3
          name: block_3_depthwise
          padding: valid
          strides: !!python/tuple
          - 2
          - 2
          trainable: false
          use_bias: false
        inbound_nodes:
        - - - block_3_pad
            - 0
            - 0
            - {}
        name: block_3_depthwise
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.999
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: block_3_depthwise_BN
          scale: true
          trainable: false
        inbound_nodes:
        - - - block_3_depthwise
            - 0
            - 0
            - {}
        name: block_3_depthwise_BN
      - class_name: ReLU
        config:
          dtype: float32
          max_value: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AADAQA==
          name: block_3_depthwise_relu
          negative_slope: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AAAAAA==
          threshold: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AAAAAA==
          trainable: false
        inbound_nodes:
        - - - block_3_depthwise_BN
            - 0
            - 0
            - {}
        name: block_3_depthwise_relu
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id003
          dtype: float32
          filters: 32
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          - 1
          name: block_3_project
          padding: same
          strides: *id003
          trainable: false
          use_bias: false
        inbound_nodes:
        - - - block_3_depthwise_relu
            - 0
            - 0
            - {}
        name: block_3_project
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.999
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: block_3_project_BN
          scale: true
          trainable: false
        inbound_nodes:
        - - - block_3_project
            - 0
            - 0
            - {}
        name: block_3_project_BN
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id003
          dtype: float32
          filters: 192
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          - 1
          name: block_4_expand
          padding: same
          strides: *id003
          trainable: false
          use_bias: false
        inbound_nodes:
        - - - block_3_project_BN
            - 0
            - 0
            - {}
        name: block_4_expand
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.999
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: block_4_expand_BN
          scale: true
          trainable: false
        inbound_nodes:
        - - - block_4_expand
            - 0
            - 0
            - {}
        name: block_4_expand_BN
      - class_name: ReLU
        config:
          dtype: float32
          max_value: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AADAQA==
          name: block_4_expand_relu
          negative_slope: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AAAAAA==
          threshold: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AAAAAA==
          trainable: false
        inbound_nodes:
        - - - block_4_expand_BN
            - 0
            - 0
            - {}
        name: block_4_expand_relu
      - class_name: DepthwiseConv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          depth_multiplier: 1
          depthwise_constraint: null
          depthwise_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          depthwise_regularizer: null
          dilation_rate: *id003
          dtype: float32
          kernel_size: !!python/tuple
          - 3
          - 3
          name: block_4_depthwise
          padding: same
          strides: !!python/tuple
          - 1
          - 1
          trainable: false
          use_bias: false
        inbound_nodes:
        - - - block_4_expand_relu
            - 0
            - 0
            - {}
        name: block_4_depthwise
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.999
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: block_4_depthwise_BN
          scale: true
          trainable: false
        inbound_nodes:
        - - - block_4_depthwise
            - 0
            - 0
            - {}
        name: block_4_depthwise_BN
      - class_name: ReLU
        config:
          dtype: float32
          max_value: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AADAQA==
          name: block_4_depthwise_relu
          negative_slope: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AAAAAA==
          threshold: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AAAAAA==
          trainable: false
        inbound_nodes:
        - - - block_4_depthwise_BN
            - 0
            - 0
            - {}
        name: block_4_depthwise_relu
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id003
          dtype: float32
          filters: 32
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          - 1
          name: block_4_project
          padding: same
          strides: *id003
          trainable: false
          use_bias: false
        inbound_nodes:
        - - - block_4_depthwise_relu
            - 0
            - 0
            - {}
        name: block_4_project
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.999
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: block_4_project_BN
          scale: true
          trainable: false
        inbound_nodes:
        - - - block_4_project
            - 0
            - 0
            - {}
        name: block_4_project_BN
      - class_name: Add
        config:
          dtype: float32
          name: block_4_add
          trainable: false
        inbound_nodes:
        - - - block_3_project_BN
            - 0
            - 0
            - &id005 {}
          - - block_4_project_BN
            - 0
            - 0
            - *id005
        name: block_4_add
      - class_name: Conv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id003
          dtype: float32
          filters: 192
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          - 1
          name: block_5_expand
          padding: same
          strides: *id003
          trainable: false
          use_bias: false
        inbound_nodes:
        - - - block_4_add
            - 0
            - 0
            - {}
        name: block_5_expand
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - - 3
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 0.001
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.999
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: block_5_expand_BN
          scale: true
          trainable: false
        inbound_nodes:
        - - - block_5_expand
            - 0
            - 0
            - {}
        name: block_5_expand_BN
      - class_name: ReLU
        config:
          dtype: float32
          max_value: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AADAQA==
          name: block_5_expand_relu
          negative_slope: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AAAAAA==
          threshold: !!python/object/apply:numpy.core.multiarray._reconstruct
            args:
            - *id001
            - !!python/tuple
              - 0
            - !!binary |
              Yg==
            state: !!python/tuple
            - 1
            - !!python/tuple []
            - *id002
            - false
            - !!binary |
              AAAAAA==
          trainable: false
        inbound_nodes:
        - - - block_5_expand_BN
            - 0
            - 0
            - {}
        name: block_5_expand_relu
      - class_name: DepthwiseConv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          depth_multiplier: 1
          depthwise_constraint: null
          depthwise_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          depthwise_regularizer: null
          dilation_rate: *id003
          dtype: float32
          kernel_size: !!python/tuple
          - 3
          - 3
          name: block_5_depthwise
          padding: same
          strides: !!python/tuple
          - 1
          - 1
          trainable: false
          use_bias: false
        inbound_nodes:
        - - - block_5_expand_relu
            - 0
            - 0
            - {}
        name: block_5_depthwise
      - class_name: BatchNormalization
        config:
